Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_group.atlantis_ecs has changed
~ resource "aws_autoscaling_group" "atlantis_ecs" {
      + arn                       = "arn:aws:autoscaling:us-east-2:398963803929:autoScalingGroup:91f38c7b-97ec-423c-9e42-d10d9df2d668:autoScalingGroupName/atlantis_ecs"
      ~ availability_zones        = [
          + "us-east-2a",
          + "us-east-2b",
          + "us-east-2c",
        ]
      + capacity_rebalance        = false
      + default_cooldown          = 300
      + enabled_metrics           = []
        id                        = "atlantis_ecs"
      + load_balancers            = []
      + max_instance_lifetime     = 0
        name                      = "atlantis_ecs"
      + service_linked_role_arn   = "arn:aws:iam::398963803929:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
      + suspended_processes       = []
      + target_group_arns         = []
      + termination_policies      = []
        # (13 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # aws_launch_configuration.ubuntu_20_04 has changed
~ resource "aws_launch_configuration" "ubuntu_20_04" {
        id                               = "atlantis_ecs"
        name                             = "atlantis_ecs"
      + security_groups                  = []
      + vpc_classic_link_security_groups = []
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_bar will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_bar" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723"
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.atlantis_ecs is tainted, so must be replaced
-/+ resource "aws_autoscaling_group" "atlantis_ecs" {
      ~ arn                       = "arn:aws:autoscaling:us-east-2:398963803929:autoScalingGroup:91f38c7b-97ec-423c-9e42-d10d9df2d668:autoScalingGroupName/atlantis_ecs" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-2a",
          - "us-east-2b",
          - "us-east-2c",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ id                        = "atlantis_ecs" -> (known after apply)
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      ~ max_size                  = 1 -> 2
      ~ min_size                  = 1 -> 0
        name                      = "atlantis_ecs"
      + name_prefix               = (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::398963803929:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
      ~ vpc_zone_identifier       = [
          - "subnet-01eb577852a061ca1",
            # (2 unchanged elements hidden)
        ]
        # (10 unchanged attributes hidden)

      + tag {
          + key                 = "Env"
          + propagate_at_launch = true
          + value               = "test"
        }
      - tag {
          - key                 = "foo" -> null
          - propagate_at_launch = true -> null
          - value               = "bar" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.ubuntu_20_04 must be replaced
-/+ resource "aws_launch_configuration" "ubuntu_20_04" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:398963803929:launchConfiguration:1390340b-0346-48c8-bdfb-9673d96c2fb3:launchConfigurationName/atlantis_ecs" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "atlantis_ecs" -> (known after apply)
      ~ instance_type                    = "t3.micro" -> "t2.micro" # forces replacement
      + key_name                         = (known after apply)
        name                             = "atlantis_ecs"
      + name_prefix                      = (known after apply)
      - security_groups                  = [] -> null
      - vpc_classic_link_security_groups = [] -> null
        # (3 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb.lb_ecs will be updated in-place
~ resource "aws_lb" "lb_ecs" {
        id                         = "arn:aws:elasticloadbalancing:us-east-2:398963803929:loadbalancer/app/lb-ecs/1ba5a14d83255d1b"
        name                       = "lb-ecs"
      ~ subnets                    = [
          - "subnet-01eb577852a061ca1",
            # (2 unchanged elements hidden)
        ]
        tags                       = {
            "Environment" = "teste"
        }
        # (16 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
